---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.StartingViewSettings
source: html/d30bb952-7afc-1d1b-f813-936d65d9cc09.htm
---
# StartingViewSettings Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.